"""============================================ №3
# имеется список списков
a = [[1,2,3], [4,5,6]]

# Задание:
# сделать список словарей
b = [{'k1': 1, 'k2': 2, 'k3': 3}, {'k1': 4, 'k2': 5, 'k3': 6}]

# *написать решение в одну строку"""


def main():
	a = [[1, 2, 3], [4, 5, 6]]
	
	b = [{'k1': 1, 'k2': 2, 'k3': 3}, {'k1': 4, 'k2': 5, 'k3': 6}]
	
	ans = [dict(((f'k{index + 1}', value) for index, value in enumerate(outer_list))) for outer_list in a]	# ОТВЕТ
	print(ans)

	assert ans == b


if __name__ == "__main__":
	main()
